{
  "education": [
    {
      "awards_achievements": [
        "Cursus includes 9 real-world projects"
      ],
      "degree": "Diploma, Level 6 qualification on the European Qualification Framework",
      "department": "Software Developer - Full Stack (Développeur·se d’application)",
      "duration": "2018-2021",
      "school_name": "OpenClassrooms"
    },
    {
      "awards_achievements": [
        "Dean's Honour Roll"
      ],
      "degree": "Honour Diploma Telecommunications Engineering Technology",
      "department": "School of Applied Sciences and Technology, Telecommunications and Electronics Engineering Technology",
      "duration": "2007-2009",
      "school_name": "NAIT (Northern Alberta Institute of Technology)"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor in Business Administration, Marketing major",
      "department": "School of Management (Casablanca)",
      "duration": "1999-2003",
      "school_name": "Groupe ISCAE"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NissaElchhab",
  "highlighted_projects": [
    {
      "description": "For the Bakdend and API, I designed, developed tested, and cloud-hosted an API that looks for nearby volunteer services or offers of help and serves that data to an authenticated frontend using HTTPS. As for the frontend (https://github.com/RtillaWork/P_8_FE), it was built in React and LeafletJs, as a map, that communicates with the API to link users' needing help with volunteers in the vicinity.",
      "git_url": "https://github.com/RtillaWork/P_8_BE",
      "name": "Build a geolocalized aid platform for your neighborhood: Backend in Ruby on Rails API mode, running on Azure VM with nginx and HTTPS/TLS; Frontend in React/Javascript/leafletjs"
    },
    {
      "description": "Built a web scraper of public library resources, particularly ArchiveGrid and OCLC with Go and Gocolly to facilitate exploratory research, downloading references, and eventually as a simpler command line search engine. Created a C++ utility to clean and extract preliminary data",
      "git_url": "https://github.com/RtillaWork/gogetitarchy",
      "name": "Build a web scraper and downloader of online library catalogs and open public library resources"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This app, which consists of a server and node agents, assists cluster admin team to survey, collect, store and monitor cluster nodes. It uses standard Linux commands and `/sys` filesystem to collect a node's configuration and real-time information. The server collects and stores that data in a PostgreSQL database for documentation and querying. The app is deployed through a lightweight Docker container and uses bash shell's scripting language.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_NissaElchhab/tree/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: This Java-based Twitter app offers a simple CLI tool to interact with the Twitter API. It allows posting a tweet with geolocation, reading a tweet's JSON object, and deleting one or many tweets. The app uses OAuth to authorize Twitter interactions, is architectured as a Spring app with components for future extensibility, and comes with an extensive suite of tests based on JUnit, Mockito, and AssertJ. The Twitter CLI is packaged in a Docker container and uses Maven as a project management and comprehension tool.",
        "JDBC App: This app allows accessing the RDBMS in a programmatic way instead of SQL. This makes the data from the database accessible to end users who are not comfortable with SQL, helps isolate the database from the end users for security purpose, and create the building blocks for future APIs and possibly a different front-end interface instead of a text/CLI one only.",
        "Grep App: This app aims to implement a simple grep-like app in Java. The Java artifact is packaged in a Docker container for ease of deployment and makes use of Java regex utilities. It also uses streams and lambdas for a cleaner code, among other benefits. It can be run from the command line with as close of an experience and results as the Linux's grep (our reference for this project is the GNU Grep."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_NissaElchhab/tree/main/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Nissa Elchhab",
  "others": [
    {
      "bullets": [
        "Google IT support, Coursera (2020)",
        "How to use OpenVAS for vulnerability assessment, Cybrary (2020)",
        "Splunk basics, RangeForce (2020)",
        "Cisco Certified Network Associate, Cisco (2013)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "French: Native proficiency",
        "English: Bilingual proficiency"
      ],
      "title": "Languages"
    },
    {
      "bullets": [
        "Learning Morse and preparing for a Ham(Amateur Radio) certification",
        "Exploring embedded hardware such as Raspberry Pi"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked under the mentorship of a Senior developer and a Scrum Master to translate user stories to readable and maintainable Java code to perform the required tasks. Wrote unit and integration tests to document and assert application correctness. Referred to documentation to tackle edge cases and collaborated with other teammates to share useful documentation and tutorials. ",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Self-employed",
      "description": "Researched, and developed for a client, a Ph.D. student, a web scraping application in Golang that helped them accelerate their research by specific keywords and using a simple CLI interface to search and download relevant research documents from online public library catalogs",
      "duration": "2022",
      "title": "Self-employed, Software Developer (Go, C++)"
    },
    {
      "company": "TELUS Communications",
      "description": "Performed Service Delivery and Assurance related to trouble analysis and resolution; documented and provisioned services (triple-play) on copper, fibre, SS7, SIP, and Long Distance; Collaborated extensively with the Voice Test Team, QA, other departments, and other international carriers to solve complex Trouble Tickets.",
      "duration": "2009-2019",
      "title": "Telecommunications Network Technician, Tier 3 Service Delivery and Assurance"
    },
    {
      "company": "Adil Réseaux (Morocco)",
      "description": "Assisted in researching cost-effective solutions, and setting up, configuring, and securing Microsoft networks for SOHO; Assisted translating relevant documentation from English to French for local customers, as well as in training users",
      "duration": "2003-2005",
      "title": "Junior Computer Network Technician"
    }
  ],
  "skills": {
    "competent": [
      "Spring Boot",
      "Docker",
      "Postman (API testing and design)",
      "HTML5/CSS3",
      "REST API",
      "Testing using JUnit and related libraries"
    ],
    "familiar": [
      "C/C++",
      "OWASP / Kali Linux / Wireshark",
      "UML / ERD",
      "Cloud services (Google Cloud, Microsoft Azure)",
      "SSL/TLS/OAuth",
      "Virtualization (Linux KVM, VMware ESXi)"
    ],
    "proficient": [
      "Java",
      "Maven",
      "Linux/Bash",
      "RDBMS/PostgreSQL",
      "Agile/Scrum",
      "Git",
      "Github",
      "Javascript (ES6)",
      "Golang",
      "Ruby on Rails"
    ]
  },
  "summary": "I am a Junior Software Developer, with experience in Java, React, Golang, and Ruby on Rails. I graduated from OpenClassrooms with a E.U bachelor's equivalent. I am passionate about software quality and well-engineered solutions that take into account green or efficient tech, and social responsibility. I was, previously, a member of the Tier 3 Network Assurance and Provisioning Team at Telus, as a Telecom Network Technician. Besides that, I hold a diploma as a Telecom/electronics Technologist and a Bachelor in Business Administration with a Marketing major. I believe that lean, secure, and Open Source software can bring a unique added value to all the stakeholders, and clearer communication and can enable optimized and agile solutions to market needs. My other interests are Information Security and science education."
}
